app/views/unis/_form_uni.html.erb

SELECT "uni_submissions".* FROM "uni_submissions" WHERE "uni_submissions"."uni_id" = 100 LIMIT 1
---

  <% if @uni.uni_submission.errors.any? %>