app/views/unis/show.html.erb

            ・志望理由書
          <% if !@uni.uni_submission.reason_details.blank? %>
---
SELECT "uni_submissions".* FROM "uni_submissions" WHERE "uni_submissions"."uni_id" = 92 LIMIT 1


      <% if !@uni.uni_subjects.empty? %>
---
SELECT "uni_subjects".* FROM "uni_subjects" WHERE "uni_subjects"."uni_id" = 95
SELECT COUNT(*) FROM "uni_subjects" WHERE "uni_subjects"."uni_id" = 92


        <% if @uni.uni_interview.deatails.present? %>
---
SELECT "uni_interviews".* FROM "uni_interviews" WHERE "uni_interviews"."uni_id" = 92 LIMIT 1