app/views/uni_subjects/_index_table.html.erb


    <% @uni.uni_subjects.each do |uni_subject| %>
---
SELECT "uni_subjects".* FROM "uni_subjects" WHERE "uni_subjects"."uni_id" = 95