app/views/uni_subjects/edit_index.html.erb

  <%= link_to_function '戻る', 'history.back()', :class => 'btn' %>
  <% if !@uni.uni_interview.blank? %>
---
SELECT "uni_interviews".* FROM "uni_interviews" WHERE "uni_interviews"."uni_id" = 100 LIMIT 1