app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 4]]
SELECT "emps".* FROM "emps" WHERE (account_id == 4) ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "emps" WHERE (account_id == 4) LIMIT 20 OFFSET 0) subquery_for_count
SELECT "unis".* FROM "unis" WHERE (account_id == 4) ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "unis" WHERE (account_id == 4) LIMIT 20 OFFSET 0) subquery_for_count
---
  def mypage
    @account = Account.find(session[:usr])
    @emps = Emp.where("account_id == ?", session[:usr]).page.order("created_at DESC").page(params[:page]).per(20)
    @unis = Uni.where("account_id == ?", session[:usr]).page.order("created_at DESC").page(params[:page]).per(20)

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = Account.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "16"]]
---
  def show
    @account = Account.find(params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @account = Account.find(params[:id])

INSERT INTO "accounts" ("admin", "created_at", "major", "name", "password", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @account = Account.new(params[:account])
    #パスワードはハッシュ化して登録
    @account.password = Digest::SHA1.hexdigest(@account.password)
    @account.password_confirmation = Digest::SHA1.hexdigest(@account.password_confirmation)
    respond_to do |format|
      if @account.save

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "accounts" SET "password" = 'da39a3ee5e6b4b0d3255bfef95601890afd80709', "updated_at" = '2013-12-23 13:55:51.599963' WHERE "accounts"."id" = 4
---
  def update
    @account = Account.find(params[:id])
    @account.attributes = params[:account]
    @account.password = Digest::SHA1.hexdigest(@account.password)
    @account.password_confirmation = Digest::SHA1.hexdigest(@account.password_confirmation)
    respond_to do |format|
      if @account.save