app/controllers/emps_controller.rb

  def index
    #報告書の作成日の新しい順に並べ替えて取得
    # @emps = Emp.order("created_at DESC")
    #           .paginate(:page => params[:page], :per_page => 20)

    @emps = Emp.page.order("created_at DESC").page(params[:page]).per(10)
---
SELECT "emps".* FROM "emps" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "emps"

  def show
    @emp = Emp.find(params[:id])
    @interview_row = []
    @selection_row = []

    @json = @emp.to_gmaps4rails # for Google Maps

    #表の表示を整えるため、行数を調べる。
    @emp.emp_selections.each do |selection|
---
SELECT "emps".* FROM "emps" WHERE "emps"."id" = ? LIMIT 1  [["id", "33"]]
SELECT "emp_selections".* FROM "emp_selections" WHERE "emp_selections"."emp_id" = 33

  def edit_impression
    @emp = Emp.find(params[:id])
---
SELECT "emps".* FROM "emps" WHERE "emps"."id" = ? LIMIT 1  [["id", "34"]]

  def update_impression
    #感想、アドバイス部分のみを変更するようにする。
    @emp = Emp.find(params[:id])
    @temp = Emp.new(params[:emp])
    @emp.impression = @temp.impression
    @emp.advice = @temp.advice
    respond_to do |format|
      if @emp.save
---
SELECT "emps".* FROM "emps" WHERE "emps"."id" = ? LIMIT 1  [["id", "34"]]
UPDATE "emps" SET "impression" = '', "advice" = '', "updated_at" = '2013-12-19 02:07:39.014725' WHERE "emps"."id" = 34

  def create
    @emp = Emp.new(params[:emp])
    @emp.emp_submission = EmpSubmission.new(params[:emp_submission])
    @emp.emp_briefing = EmpBriefing.new(params[:emp_briefing])
    @emp.emp_webtest = EmpWebtest.new(params[:emp_webtest])

    @emp.emp_submission.emp = @emp
    @emp.emp_briefing.emp = @emp
    @emp.emp_webtest.emp = @emp

    @emp.account = Account.find(session[:usr])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 4]]

    respond_to do |format|
      #エラーがない場合保存
      if !@error_flag
        @emp.save
---
INSERT INTO "emps" ("account_id", "advice", "created_at", "entrysheet", "glouping", "gmaps", "impression", "latitude", "location", "longitude", "name", "submit", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @emp = Emp.find(params[:id])

    @selections = EmpSelection.where(:emp_id => @emp)
    @selections.each do |selection|
        if(selection.emp_interview != nil)
            selection.emp_interview.destroy
        end
        if(selection.emp_test != nil)
            selection.emp_test.destroy
        end
        if(selection.emp_essay != nil)
            selection.emp_essay.destroy
        end
        selection.destroy
    end

    if(@emp.emp_submission != nil)
        @emp.emp_submission.destroy
    end
    if(@emp.emp_briefing != nil)
        @emp.emp_briefing.destroy
    end
    if(@emp.emp_webtest != nil)
        @emp.emp_webtest.destroy
---
SELECT "emps".* FROM "emps" WHERE "emps"."id" = ? LIMIT 1  [["id", "30"]]
SELECT "emp_selections".* FROM "emp_selections" WHERE "emp_selections"."emp_id" = 30
DELETE FROM "emp_interviews" WHERE "emp_interviews"."id" = ?  [["id", 20]]
DELETE FROM "emp_selections" WHERE "emp_selections"."id" = ?  [["id", 21]]
DELETE FROM "emps" WHERE "emps"."id" = ?  [["id", 30]]
DELETE FROM "emp_tests" WHERE "emp_tests"."id" = ?  [["id", 21]]
DELETE FROM "emp_essays" WHERE "emp_essays"."id" = ?  [["id", 21]]
DELETE FROM "emp_submissions" WHERE "emp_submissions"."id" = ?  [["id", 29]]
DELETE FROM "emp_briefings" WHERE "emp_briefings"."id" = ?  [["id", 29]]
DELETE FROM "emp_webtests" WHERE "emp_webtests"."id" = ?  [["id", 29]]