app/controllers/search_controller.rb

SELECT "emps".* FROM "emps" WHERE (name LIKE '%%' AND location LIKE '%長野%') ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "emps" WHERE (name LIKE '%%' AND location LIKE '%長野%') LIMIT 10 OFFSET 0) subquery_for_count
---
  def result_emp
    if !params[:commit].blank?
      @name = params[:name]
      session[:name] = @name
      @location = params[:location]
      session[:location] = @location
      if params[:glouping] == "suisen"
        @glouping = true
      elsif params[:glouping] == "jiyu"
        @glouping = false
      end
      session[:glouping]
    else
      @name = session[:name]
      @location = session[:location]
      @glouping = session[:glouping]
    end

    if @glouping != nil
      @emps = Emp.where("name LIKE ? AND location LIKE ? AND glouping == ?",
        "%#{@name}%","%#{@location}%",@glouping).
        order("created_at DESC").page(params[:page]).per(10)

SELECT "unis".* FROM "unis" WHERE (name LIKE '%東京%' AND location LIKE '%%' AND major LIKE '%%') ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "unis" WHERE (name LIKE '%東京%' AND location LIKE '%%' AND major LIKE '%%') LIMIT 10 OFFSET 0) subquery_for_count
---
  def result_uni
    if !params[:commit].blank?
      @name = params[:name]
      session[:name] = @name
      @location = params[:location]
      session[:location] = @location
      if params[:glouping] == "suisen"
        @glouping = true
      elsif params[:glouping] == "jiyu"
        @glouping = false
      end
      session[:glouping]
      @key_subjects = params[:subjects]
      session[:subjects] = @key_subjects
      @major = params[:major]
      session[:major] = @major
    else
      @name = session[:name]
      @location = session[:location]
      @glouping = session[:glouping]
      @key_subjects = session[:subjects]
      @major = session[:major]
    end

    if @glouping != nil
      @unis = Uni.where("name LIKE ? AND location LIKE ? AND glouping == ? AND major LIKE ?",
        "%#{@name}%","%#{@location}%",@glouping,"%#{@major}%").
        order("created_at DESC").page(params[:page]).per(10)