app/controllers/unis_controller.rb

SELECT "unis".* FROM "unis" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "unis"
---
  def index
    # @unis = Uni.order("created_at DESC").
    #   paginate(:page => params[:page], :per_page => 20)
    @unis = Uni.page.order("created_at DESC").page(params[:page]).per(10)

SELECT "unis".* FROM "unis" WHERE "unis"."id" = ? LIMIT 1  [["id", "92"]]
---
  def show
    @uni = Uni.find(params[:id])

SELECT "unis".* FROM "unis" WHERE "unis"."id" = ? LIMIT 1  [["id", "100"]]
---
  def edit
    @uni = Uni.find(params[:id])

SELECT "unis".* FROM "unis" WHERE "unis"."id" = ? LIMIT 1  [["id", "95"]]
---
  def edit_impression
    @uni = Uni.find(params[:id])

SELECT "unis".* FROM "unis" WHERE "unis"."id" = ? LIMIT 1  [["id", "95"]]
UPDATE "unis" SET "impression" = 'あ', "advice" = 'い', "updated_at" = '2013-12-19 05:12:09.634103' WHERE "unis"."id" = 95
---
  def update_impression
    @uni = Uni.find(params[:id])
    @uni.attributes = params[:uni]

    respond_to do |format|
      if @uni.save

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "uni_apps" ("created_at", "end", "start", "uni_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 19 Dec 2013 03:26:03 UTC +00:00], ["end", Thu, 19 Dec 2013], ["start", Thu, 19 Dec 2013], ["uni_id", 95], ["updated_at", Thu, 19 Dec 2013 03:26:03 UTC +00:00]]
INSERT INTO "uni_exams" ("created_at", "end", "start", "uni_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 19 Dec 2013 03:26:03 UTC +00:00], ["end", Thu, 19 Dec 2013], ["start", Thu, 19 Dec 2013], ["uni_id", 95], ["updated_at", Thu, 19 Dec 2013 03:26:03 UTC +00:00]]
INSERT INTO "uni_results" ("created_at", "day", "result", "uni_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 19 Dec 2013 03:26:03 UTC +00:00], ["day", Thu, 19 Dec 2013], ["result", true], ["uni_id", 95], ["updated_at", Thu, 19 Dec 2013 03:26:03 UTC +00:00]]
INSERT INTO "uni_submissions" ("created_at", "other", "reason", "reason_details", "recommendation", "result", "survey", "uni_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @uni = Uni.new(params[:uni])
    @uni.uni_submission = UniSubmission.new(params[:uni_submission])
    @uni.uni_app = UniApp.new(params[:uni_app])
    @uni.uni_exam = UniExam.new(params[:uni_exam])
    @uni.uni_result = UniResult.new(params[:uni_result])
    @uni.uni_result.uni = @uni
    @uni.uni_submission.uni = @uni
    @uni.uni_app.uni = @uni
    @uni.uni_exam.uni = @uni
    @uni.account = Account.find(session[:usr])

    @uni.valid?
    if(@uni.errors.any?)
      @error_flag = true
    end

    @uni.uni_submission.valid?
    if(@uni.uni_submission.errors.any?)
      @error_flag = true
    end

    respond_to do |format|
      if !@error_flag
        @uni.save

SELECT "unis".* FROM "unis" WHERE "unis"."id" = ? LIMIT 1  [["id", "100"]]
SELECT "uni_apps".* FROM "uni_apps" WHERE "uni_apps"."uni_id" = 100 LIMIT 1
SELECT "uni_exams".* FROM "uni_exams" WHERE "uni_exams"."uni_id" = 100 LIMIT 1
SELECT "uni_results".* FROM "uni_results" WHERE "uni_results"."uni_id" = 100 LIMIT 1
SELECT "uni_submissions".* FROM "uni_submissions" WHERE "uni_submissions"."uni_id" = 100 LIMIT 1
---
  def update
    @uni = Uni.find(params[:id])

    @uni.attributes = params[:uni]
    @uni.uni_submission.attributes = params[:uni_submission]
    @uni.uni_app.attributes = params[:uni_app]
    @uni.uni_exam.attributes = params[:uni_exam]
    @uni.uni_result.attributes = params[:uni_result]

    @uni.valid?
    if(@uni.errors.any?)

SELECT "unis".* FROM "unis" WHERE "unis"."id" = ? LIMIT 1  [["id", "91"]]
DELETE FROM "uni_submissions" WHERE "uni_submissions"."id" = ?  [["id", 91]]
DELETE FROM "unis" WHERE "unis"."id" = ?  [["id", 91]]
DELETE FROM "uni_apps" WHERE "uni_apps"."id" = ?  [["id", 91]]
DELETE FROM "uni_exams" WHERE "uni_exams"."id" = ?  [["id", 91]]
SELECT "uni_apps".* FROM "uni_apps" WHERE "uni_apps"."uni_id" = 91 LIMIT 1
SELECT "uni_exams".* FROM "uni_exams" WHERE "uni_exams"."uni_id" = 91 LIMIT 1
SELECT "uni_subjects".* FROM "uni_subjects" WHERE "uni_subjects"."uni_id" = 91
SELECT "uni_submissions".* FROM "uni_submissions" WHERE "uni_submissions"."uni_id" = 91 LIMIT 1
DELETE FROM "uni_interviews" WHERE "uni_interviews"."id" = ?  [["id", 100]]
DELETE FROM "uni_subjects" WHERE "uni_subjects"."id" = ?  [["id", 41]]
DELETE FROM "uni_results" WHERE "uni_results"."id" = ?  [["id", 108]]
---
  def destroy
    @uni = Uni.find(params[:id])

    if(@uni.uni_submission != nil)
        @uni.uni_submission.destroy
    end
    if(@uni.uni_app != nil)
        @uni.uni_app.destroy
    end
    if(@uni.uni_exam != nil)
        @uni.uni_exam.destroy
    end

    @uni.uni_subjects.each do |sub|
        sub.destroy
    end

    if(@uni.uni_interview != nil)
        @uni.uni_interview.destroy
    end

    if(@uni.uni_result != nil)
        @uni.uni_result.destroy