app/views/emp_selections/_index_table.html.erb

SELECT "emp_selections".* FROM "emp_selections" WHERE "emp_selections"."emp_id" = 34
---

<% @emp.emp_selections.each do |emp_selection| %>