app/views/emps/_index_table.html.erb

SELECT "emp_selections".* FROM "emp_selections" WHERE "emp_selections"."emp_id" = 33
---
    <td><%= link_to emp.name, emp, :style=>"background-color:transparent;"%></td>
    <td><% emp.emp_selections.each do |selection| %>