app/views/emps/show.html.erb

SELECT "emp_submissions".* FROM "emp_submissions" WHERE "emp_submissions"."emp_id" = 33 LIMIT 1
---
          <% end %>
          <% if @emp.emp_submission.other.blank? %>

SELECT "emp_briefings".* FROM "emp_briefings" WHERE "emp_briefings"."emp_id" = 33 LIMIT 1
---

      <% if !@emp.emp_briefing.details.blank? %>

SELECT "emp_webtests".* FROM "emp_webtests" WHERE "emp_webtests"."emp_id" = 33 LIMIT 1
---

      <% if !@emp.emp_webtest.details.blank? %>

SELECT "emp_selections".* FROM "emp_selections" WHERE "emp_selections"."emp_id" = 33
---

      <% @emp.emp_selections.each do |selection| %>