app/views/accounts/mypage.html.erb

SELECT "emp_selections".* FROM "emp_selections" WHERE "emp_selections"."emp_id" = 35
---
      <td><%= link_to emp.name, emp, :style=>"background-color: transparent;" %></td>
      <td><% emp.emp_selections.each do |selection| %>